In [3]:
b=open('data.csv','x')
b.close()

In [19]:
b=open('data.csv','r')
print(b.read())
b.close()

sn,name,age,phone,address
1,hari,19,9814525507,kathmandu
2,sita,21,8872735418,patan
3,gita,20,9848407837,nepalgunj

In [ ]:
#lpip install pandas

In [20]:
import pandas as pd 
df=pd.read_csv('data.csv')
df

   sn  name  age       phone    address
0   1  hari   19  9814525507  kathmandu
1   2  sita   21  8872735418      patan
2   3  gita   20  9848407837  nepalgunj

In [21]:
import pandas as pd 
df=pd.read_csv('data.csv',nrows=4)
df

   sn  name  age       phone    address
0   1  hari   19  9814525507  kathmandu
1   2  sita   21  8872735418      patan
2   3  gita   20  9848407837  nepalgunj

In [22]:
import pandas as pd 
df=pd.read_csv('data.csv',nrows=4,index_col='sn')
df

    name  age       phone    address
sn
1   hari   19  9814525507  kathmandu
2   sita   21  8872735418      patan
3   gita   20  9848407837  nepalgunj

In [23]:
import pandas as pd 
df=pd.read_csv('data.csv',nrows=4,index_col='sn')
# df.head()
df.tail()

    name  age       phone    address
sn
1   hari   19  9814525507  kathmandu
2   sita   21  8872735418      patan
3   gita   20  9848407837  nepalgunj

In [24]:
import pandas as pd 
df=pd.read_csv('data.csv',nrows=4,index_col='sn')
df.head()

    name  age       phone    address
sn
1   hari   19  9814525507  kathmandu
2   sita   21  8872735418      patan
3   gita   20  9848407837  nepalgunj

In [25]:
import pandas as pd 
df=pd.read_csv('data.csv',usecols=['sn','name','phone'],index_col='sn')
df.head()

    name       phone
sn
1   hari  9814525507
2   sita  8872735418
3   gita  9848407837

In [26]:
import pandas as pd 
df=pd.read_csv('data.csv',index_col='sn')
df.iloc[1:5]

    name  age       phone    address
sn
2   sita   21  8872735418      patan
3   gita   20  9848407837  nepalgunj

In [27]:
import pandas as pd 
df=pd.read_csv('data.csv',index_col='sn')
df.iloc[1:5,0:3]

    name  age       phone
sn
2   sita   21  8872735418
3   gita   20  9848407837

In [28]:
import pandas as pd 
df=pd.read_csv('data.csv',index_col='sn')
df.loc[1:6]

    name  age       phone    address
sn
1   hari   19  9814525507  kathmandu
2   sita   21  8872735418      patan
3   gita   20  9848407837  nepalgunj

In [29]:
import pandas as pd 
df=pd.read_csv('data.csv',index_col='name')
df.loc['sita':'gita']

      sn  age       phone    address
name
sita   2   21  8872735418      patan
gita   3   20  9848407837  nepalgunj

In [30]:
import pandas as pd 
df=pd.read_csv('data.csv',index_col='sn')
df[df['address']=='kathmandu']

    name  age       phone    address
sn
1   hari   19  9814525507  kathmandu

In [3]:
import pandas as pd 
df=pd.read_csv('data.csv',index_col='sn')
df[(df['age']>=20) & (df['address']=='nepalgunj')]

    name  age       phone    address
sn
3   gita   20  9848407837  nepalgunj

In [4]:
import pandas as pd
data={'name':['ram','hari','sita'],
     'class':[10,34,56]}
df=pd.DataFrame(data)
df

   name  class
0   ram     10
1  hari     34
2  sita     56

In [5]:
import pandas as pd
data={'name':['ram','hari','sita'],
     'class':[10,34,56],
     'grade':['A','B','c']}
df=pd.DataFrame(data)
df.to_csv('data.csv')
df

   name  class grade
0   ram     10     A
1  hari     34     B
2  sita     56     c

In [8]:
import csv
fields=['kamal',28,'butwal']
f=open('data.csv','a')
x=csv.writer(f)
x.writerow(fields)
f.close()

In [4]:
import csv
fields=[['name','age','addres'],
         ['kamal',28,'butwal'],
        ['sabin',23,'patan']]
        
f=open('data.csv','w')
x=csv.writer(f)
        
for i in fields:
    x.writerow(i)
    
f.close()

import pandas as pd 
df= pd.read_csv('data.csv')
df

In [2]:
import csv
with open ('data.csv') as csvfile:
    reader=csv.DictReader(csvfile)
    for row in reader:
        print(dict(row))

{'name': 'kamal', 'age': '28', 'addres': 'butwal'}
{'name': 'sabin', 'age': '23', 'addres': 'patan'}

In [3]:
import csv
csv_data=[]
with open ('data.csv') as csvfile:
    reader=csv.DictReader(csvfile)
    for row in reader:
        csv_data.append(dict(row))
        
csv_data

[{'name': 'kamal', 'age': '28', 'addres': 'butwal'},
 {'name': 'sabin', 'age': '23', 'addres': 'patan'}]

In [10]:
import csv
csv_columns=['name','age','address']
dict[
    {'name':'hari','age':30,'address':'kathmandu'},
    {'name':'sita','age':21,'address':'patan'}]

with open('data.csv','w') as csvfile:
    
    writer=csv.DictWriter(csvfile, fieldnames=csv_columns)
    writer.writeheader()
    
    for data in dict:
        writer.writerow(data)

TypeError: 'type' object is not iterable